In [41]:
import pandas as pd
import numpy as np
import datetime
import os
# //from seko import extract_date_from_html, save_frame, HYDROMETERDIR, VODOMERDIR
def t_num(df, cols):
    for col in cols:
        df[col] = pd.to_numeric(df[col], errors='coerce')
    return df

df = pd.DataFrame(np.array([[1], ['-'],[3.0]]*3).reshape(3,-3), columns=['A','B','C'])
df
c=np.array([[1], ['-'],[3.0]]*3)[:, np.newaxis]
c=np.array([1, '-',3.0]*3)[:, np.newaxis]
c=np.array([1, '-',3.0]*3)
df.B = pd.to_numeric(df.B, errors='coerce')
# df.B = df.B.replace('-', pd.NA)
df1 = t_num(df, ['B','C'])
df1

   A   B    C
0  1 NaN  3.0
1  1 NaN  3.0
2  1 NaN  3.0